paddy2008/c51_uboot/src/Efm8lb12_cmd.c
#include "mcu_sal.h"
#include "Efm8lb12_cmd.h"
#include "Efm8lb12_port.h"
#include "Efm8lb12_qsfp28.h"

TIMER_STRUCT_T prbs_code_timer;
TIMER_STRUCT_T rssi_poll_timer;
TIMER_STRUCT_T intl_trigger_timer;

/************************************************function declaration************************************************************/
#if 0
uint8_t smb_read_multi_byte_test(uint8_t BaseAddr,uint16_t OffsetAddr,uint8_t *Pdata,uint16_t Length)
{
	uint32_t i = 0;

	for (i = 0;SMB_BUSY;i++); // Wait for SMBus to be free.
	SMB_BUSY = 1;                       // Claim SMBus (set to busy)

	// Set SMBus ISR parameters
	TARGET = BaseAddr;               	// Set target slave address
	SMB_RW = WRITE;                     // A random read starts as a write
									    // then changes to a read after
									    // the repeated start is sent. The
									    // ISR handles this switchover if
									    // the <SMB_RANDOMREAD> bit is set.
	SMB_SENDWORDADDR = 1;               // Send Word Address after Slave Address
	SMB_RANDOMREAD = 1;                 // Send a START after the word address
	SMB_ACKPOLL = 0;                    // Enable Acknowledge Polling

	if(BaseAddr == 0xa8 || BaseAddr == 0xb8 || BaseAddr == 0x24) //12bit offsetaddr
    {
    	WORD_ADDR_HIGH = (OffsetAddr & 0xFF00) >> 8;
    	WORD_ADDR_LOW = OffsetAddr & 0xFF;
    	gSingleByteOffsetAddr = false;
    }
    else
    {
    	WORD_ADDR_LOW = OffsetAddr & 0xFF;
    	gSingleByteOffsetAddr = true;
    }

	// Set the the incoming data pointer
	pSMB_DATA_IN = Pdata;
	SMB_DATA_LEN = Length;                // Specify to ISR that the next transferwill contain <len> data bytes

	// Initiate SMBus Transfer
	SMB0CN0_STA = 1;

	/*
	for(i = 0;SMB_BUSY;i++)                       // Wait until data is read
	{
		if (i >= 0xfffff)
		{
 			uart_printf("\r\nRead multi type timeout,reset smbus");
			SMB0CF &= ~0x80;           // Reset communication
			SMB0CF |= 0x80;
			SMB0CN0_STA = 0;
			SMB0CN0_STO = 0;
			SMB0CN0_ACK = 0;
			SMB_BUSY = 0;              // Free SMBus
			SMB_ACKPOLL = 0;
			return RET_FAILED;
		}
	}
	*/

	return RET_OK;
}

#endif

static RETURN_VALUE_TYPE prvDispEepConfig(PARAM_INFO_T  *param)//eep [init|show|regset|erase] devaddr offsetaddr value
{
	uint8_t ret = RET_OK;

	if(!strcmp(param->argv[1],"init"))
	{
		ret = qsfp28_eep_handle(EEP_INIT, 0, 0, 0);
	}
	else if(!strcmp(param->argv[1],"show"))
	{
		ret = qsfp28_eep_handle(EEP_SHOW, 0, 0, 0);
	}
	else if(!strcmp(param->argv[1],"regset"))
	{
		SAVE_REG_T save_reg;
		save_reg.devAddr    = com_str_to_int16(param->argv[2]);
		save_reg.offsetAddr = com_str_to_int16(param->argv[3]);
		save_reg.value      = com_str_to_int16(param->argv[4]);
		ret = qsfp28_eep_handle(EEP_SAVE, save_reg.devAddr, save_reg.offsetAddr, save_reg.value);
	}
	else if(!strcmp(param->argv[1],"erase"))
	{
		ret = qsfp28_eep_handle(EEP_ERASE, 0, 0, 0);
	}
	return ret;
}

static RETURN_VALUE_TYPE prvDispOprwConfig(PARAM_INFO_T  *param)
{
	I2C_DATA_T i2c_data;
	uint8_t databuff[200] = {0};  //read 200 bytes at one time
	uint8_t result = RET_FAILED;
	uint8_t page = 0;

	i2c_data.devAddr 	= com_str_to_int16(param->argv[1]);
	i2c_data.offsetAddr = com_str_to_int16(param->argv[2]);
	i2c_data.readData   = databuff;
	i2c_data.writeData  = databuff;
	i2c_data.i2c_dbg_mode = false;  //false:normal i2c mode,true:dbg i2c mode

	if ((!strcmp(param->argv[0],"opw"))||(!strcmp(param->argv[0],"opwt")))
	{
		i2c_data.rwType = WRITE_CMD;
	}
	else if ((!strcmp(param->argv[0],"opr"))||(!strcmp(param->argv[0],"oprt")))
	{
		i2c_data.rwType = READ_CMD;
	}

	if(i2c_data.rwType == READ_CMD)
	{
		if(param->argc < 3)
		{
			return RET_FAILED;
		}
		else if(param->argc == 3)
		{
			i2c_data.rwByteNum = 1;
		}
		else
		{
			i2c_data.rwByteNum = (com_str_to_int16(param->argv[3]) > 200) ? 200 : com_str_to_int16(param->argv[3]);
		}
	}
	else if(i2c_data.rwType == WRITE_CMD)
	{
		uint8_t i = 0, index = 0;

		if(param->argc < 4)
		{
			return RET_FAILED;
		}
		else if(param->argc == 0x4)
		{
			i2c_data.rwByteNum = param->argc - 3;
			index = 3;
		}
		else
		{
			i2c_data.rwByteNum = ((param->argc - 4) > 128) ? 128 : (param->argc - 4);
			index = 4;
		}

		for(i= 0; i < i2c_data.rwByteNum;i++ )
		{
			databuff[i] = com_str_to_int16(param->argv[index + i]);
		}
	}
	else
	{
		return RET_FAILED;
	}

	if((strcmp(param->argv[0],"opwt")) && strcmp(param->argv[0],"oprt"))
	{
		if(i2c_data.devAddr != I2C_DEVICE_ADDR && i2c_data.devAddr != I2C_DEVICE_ADDR1)
		{
			i2c_data.i2c_dbg_mode = true;
		}
		else
		{
			i2c_master_read_byte(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, &page);
		}
	}

	if(i2c_data.rwType == READ_CMD)
	{
		if((i2c_data.i2c_dbg_mode == true) && (i2c_data.devAddr != I2C_DEVICE_ADDR))
		{
			result = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
			JUDGE_RETURN(result);
			result = i2c_pass_through_read(i2c_data.devAddr, page, i2c_data.offsetAddr, i2c_data.readData, i2c_data.rwByteNum);
		}
		else
		{
			result = i2c_master_read(i2c_data.devAddr, i2c_data.offsetAddr,  i2c_data.readData, i2c_data.rwByteNum);
		}
	}
	else
	{
		if(i2c_data.i2c_dbg_mode == true)
		{
			result = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
			JUDGE_RETURN(result);
			result = i2c_pass_through_write(i2c_data.devAddr, page, i2c_data.offsetAddr, i2c_data.readData, i2c_data.rwByteNum);
		}
		else
		{
			result = i2c_master_write(i2c_data.devAddr, i2c_data.offsetAddr, i2c_data.readData, i2c_data.rwByteNum);
		}
	}

	if(result == RET_OK)
	{
		uart_printf("\r\n The value on page (0x%bx), index(0x%x) : ",i2c_data.devAddr,i2c_data.offsetAddr);
		while(i2c_data.rwByteNum --)
		{
			uart_printf(" 0x%bx",*(i2c_data.readData++));
		}
	}
	return result;
}


static RETURN_VALUE_TYPE prvDispMdiorwConfig(PARAM_INFO_T  *param)
{
	I2C_DATA_T i2c_data;
	uint16_t databuff[10] = {0};  //
	uint8_t result = RET_OK;
	uint8_t page = 0;
	uint32_t ret = 0;

	i2c_data.devAddr 	= com_str_to_int16(param->argv[1]);  //mdior 0x3 0x5
	i2c_data.offsetAddr = com_str_to_int16(param->argv[2]);

	//i2c_data.readData   = databuff;
	//i2c_data.writeData  = databuff;
	i2c_data.i2c_dbg_mode = false;  //false:normal i2c mode,true:dbg i2c mode

	if (!strcmp(param->argv[0],"mdiow"))
	{
		i2c_data.rwType = WRITE_CMD;
	}
	else if (!strcmp(param->argv[0],"mdior"))
	{
		i2c_data.rwType = READ_CMD;
	}

	if(i2c_data.rwType == READ_CMD)
	{
		if(param->argc < 3)
		{
			return RET_FAILED;
		}
		else if(param->argc == 3)
		{
			i2c_data.rwByteNum = 1;
		}
		else
		{
			i2c_data.rwByteNum = (com_str_to_int16(param->argv[3]) > 200) ? 200 : com_str_to_int16(param->argv[3]);
		}
	}
	else if(i2c_data.rwType == WRITE_CMD)
	{
		uint8_t i = 0, index = 0;

