paddy2008/c51_uboot/src/Efm8lb12_cmd.c
		if(param->argc < 4)
		{
			return RET_FAILED;
		}
		else if(param->argc == 0x4)
		{
			i2c_data.rwByteNum = param->argc - 3;
			index = 3;
		}
		else
		{
			i2c_data.rwByteNum = ((param->argc - 4) > 128) ? 128 : (param->argc - 4);
			index = 4;
		}

		for(i= 0; i < i2c_data.rwByteNum;i++ )
		{
			databuff[i] = com_str_to_int16(param->argv[index + i]);
		}
	}
	else
	{
		return RET_FAILED;
	}


	if(i2c_data.rwType == READ_CMD)
	{
		//uint32_t reg =  i2c_data.devAddr << 16 | i2c_data.offsetAddr;
		//ret = (uint16_t)mdio_bb_read(0x1, reg);

		ret = mdio_read(0x1, i2c_data.devAddr, i2c_data.offsetAddr);

		uart_printf("\r\n The value on page (0x%bx), index(0x%hx) : ",i2c_data.devAddr,i2c_data.offsetAddr);

		while(i2c_data.rwByteNum --)
		{
			uart_printf(" 0x%lx", ret);
		}
	}
	else
	{
		//uint32_t reg =  i2c_data.devAddr << 16 | i2c_data.offsetAddr;
		//mdio_bb_write(0x1, reg, databuff[0]);

		mdio_write(0x1, i2c_data.devAddr, i2c_data.offsetAddr, databuff[0]);

		uart_printf("\r\n The value on page (0x%bx), index(0x%x) : ",i2c_data.devAddr,i2c_data.offsetAddr);

		while(i2c_data.rwByteNum --)
		{
			uart_printf(" 0x%hx", databuff[0]);
		}
	}


	return result;
}

static RETURN_VALUE_TYPE prvDispVersionConfig(PARAM_INFO_T  *param)
{
	uart_printf( "\r\n MCU_TEST_BOARD-v%bu.%bu    %s.%s", VERSION_MAJOR, VERSION_MINOR, __DATE__,__TIME__);

	param = NULL;
	return RET_OK;
}

static RETURN_VALUE_TYPE prvDispConfigModConfig(PARAM_INFO_T  *param)
{
	RETURN_VALUE_TYPE ret = RET_OK;

	if(!strcmp(param->argv[1],"enable"))
	{
		ret = qsfp28_config_mod_console(true);
	}
	else
	{
		ret = qsfp28_config_mod_console(false);
	}
	return ret;
}

static RETURN_VALUE_TYPE prvDispMsaDownloadConfig()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x0;
	P1MDOUT &= ~P1MDOUT_B5__PUSH_PULL ;

	SFRPAGE = 0x20;
	P2MDOUT &= ~P2MDOUT_B0__PUSH_PULL ;

	RESET  = 1;
	MODSEL = 1;

	SFRPAGE = SFRPAGE_SAVE;
	return RET_OK;
}

static RETURN_VALUE_TYPE prvDispResetConfig()
{
	uint8_t ret = RET_OK;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);
	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_CMD, DBG_RESET_CMD);
	return ret;
}

static RETURN_VALUE_TYPE prvDispRebootConfig()
{
	uint8_t ret = RET_OK;

	ret = prvDispResetConfig();
	JUDGE_RETURN(ret);
	//M37046_txcdr_reset();
	//M37049_txcdr_reset();
	RSTSRC |= 0x10;			//Writing a 1 to fourth bit forces a system reset
	return ret;
}

static RETURN_VALUE_TYPE prvDispLpmodeConfig(PARAM_INFO_T  *param)
{
	uint8_t value = 0, ret = RET_OK;

	if (!strcmp(param->argv[0], "set"))
	{
		value = (uint8_t)com_str_to_int16(param->argv[2]);
		LPMODE = (value ? 1 : 0);
	}
	else if (!strcmp(param->argv[0], "get"))
	{
		uart_printf( "\r\nlpmode is %bu",LPMODE ? 1 : 0);
	}
	else
	{
		ret = RET_FAILED;
	}
	return ret;
}

static RETURN_VALUE_TYPE prvDispgsetResetConfig(PARAM_INFO_T  *param)
{
	uint8_t value = 0, ret = RET_OK;

	if (!strcmp(param->argv[0], "set"))
	{
		value = (uint8_t)com_str_to_int16(param->argv[2]);
		RESET = (value ? 1 : 0);
		com_delay_us(1);
		RESET = 1;
	}
	else if (!strcmp(param->argv[0], "get"))
	{
		uart_printf( "\r\nreset is %bu",RESET ? 1 : 0);
	}
	else
	{
		ret = RET_FAILED;
	}
	return ret;
}

static RETURN_VALUE_TYPE prvDispgsetResetLevelConfig(PARAM_INFO_T  *param)
{
	uint8_t value = 0, ret = RET_OK;

	if (!strcmp(param->argv[0], "set"))
	{
		value = (uint8_t)com_str_to_int16(param->argv[2]);
		RESET = (value ? 1 : 0);
	}
	else if (!strcmp(param->argv[0], "get"))
	{
		uart_printf( "\r\nreset is %bu",RESET ? 1 : 0);
	}
	else
	{
		ret = RET_FAILED;
	}
	return ret;
}

static RETURN_VALUE_TYPE prvDispLogConfig(PARAM_INFO_T  *param)
{
	DEBUG_LOG_ACTION type;

	if(!strcmp(param->argv[0],"clear"))
	{
		type = CLEAR_LOG_CMD;
	}
	else if(!strcmp(param->argv[0],"enable"))
	{
		type = ENABLE_LOG_CMD;
	}
	else if(!strcmp(param->argv[0],"disable"))
	{
		type = DISABLE_LOG_CMD;
	}
	else if(!strcmp(param->argv[0],"read"))
	{
		type = READ_LOG_CMD;
	}
	else
	{
		return RET_FAILED;
	}

	return qsfp28_debug_log_handle(type);
}

static RETURN_VALUE_TYPE prvDispModselConfig(PARAM_INFO_T  *param)
{
	uint8_t value = 0, ret = RET_OK;

	if (!strcmp(param->argv[0], "set"))
	{
		value = (uint8_t)com_str_to_int16(param->argv[2]);
		MODSEL = (value ? 1 : 0);
	}
	else if (!strcmp(param->argv[0], "get"))
	{
		uart_printf( "\r\nmodsel is %bu",MODSEL ? 1 : 0);
	}
	else
	{
		ret = RET_FAILED;
	}
	return ret;
}

static RETURN_VALUE_TYPE prvDispTestModselConfig(PARAM_INFO_T  *param)
{
	uint8_t value = 0, tmp[256] = {0},ret = RET_OK;

	if (!strcmp(param->argv[1], "modsel"))  //test modsel 0|1
	{
		if (!strcmp(param->argv[0], "test"))  //test modsel 0|1
		{
			if (!strcmp(param->argv[2], "aborted"))  //test modsel aborted
			{
				//smb_read_multi_byte_test(I2C_DEVICE_ADDR, 0x0, &tmp, 256); //12.5ms
				timer_delay_ms(6);
				MODSEL = 1;

				#if I2C_MASTER_MODE
					i2c_master_reset();
				#endif
				com_delay_us(100);

				if(RET_OK == i2c_master_read_byte(0x16, 0x0, &value))
				{
					uart_printf( "\r\nmodsel is %bu and dvt test board 37046 reg0 = %bx",MODSEL ? 1 : 0, value);
				}

				MODSEL = 0;
				if(RET_OK == i2c_master_read_byte(I2C_DEVICE_ADDR, 0x0, &value))
				{
					uart_printf( "\r\nmodsel is %bu and qsfp28 lower page0 = %bx",MODSEL ? 1 : 0, value);
				}

			}
			else
			{
				value = (uint8_t)com_str_to_int16(param->argv[2]);
				MODSEL = (value ? 1 : 0);
				com_delay_us(1);
				if(RET_OK == i2c_master_read_byte(I2C_DEVICE_ADDR, 0x0, &value))
				{
					uart_printf( "\r\nmodsel is %bu and value = %bx",MODSEL ? 1 : 0, value);
				}
			}
		}
	}
	else
	{
		ret = RET_FAILED;
	}
	return ret;
}

static uint8_t prvDispInitConfig(PARAM_INFO_T  *param)
{
	uint8_t value = 0, ret = RET_OK;

	param = NULL;

	uart_printf( "\r\nintl is %bu",INTL ? 1 : 0);
	return ret;
}

static RETURN_VALUE_TYPE prvDispSwverConfig(PARAM_INFO_T  *param)
{
	uint8_t value = 0, ret = RET_OK;

	if (!strcmp(param->argv[0], "get"))
	{
		ret = qsfp28_get_mod_release_info();
	}
	return ret;
}

static RETURN_VALUE_TYPE prvDispModStatusConfig(PARAM_INFO_T  *param)
{
	uint8_t value = 0, ret = RET_OK;

	if (!strcmp(param->argv[0], "get"))
	{
		if(com_get_module_boot_status())
		{
			ret = qsfp28_get_mod_release_info();
		}
		else
		{
			ret = RET_FAILED;
		}
	}
	else
	{
		ret = RET_FAILED;
	}
	if(ret == RET_OK)
	{
		uart_printf("%s","\r\nModule boot success");
	}
	else
	{
		uart_printf("%s","\r\nModule boot error");
	}
	return ret;
}

