paddy2008/c51_uboot/src/Efm8lb12_cmd.c
static RETURN_VALUE_TYPE prvDispModuleConfig(PARAM_INFO_T  *param)
{
	uint8_t value = 0, channel = 0, ret = RET_OK;

	 ret = qsfp28_get_msa_lower_page_monitor();

	 if(!strcmp(param->argv[2],"vcc"))
	 {
		 ret = qsfp28_get_ddmi(DDMI_VCC, 0, DDMI_CALI_AFTER);
	 }
	 else if(!strcmp(param->argv[2],"temp"))
	 {
		 ret = qsfp28_get_ddmi(DDMI_TEMP, 0, DDMI_CALI_AFTER);
	 }
	 else
	 {
		 channel = (uint8_t)com_str_to_int16(param->argv[3]);

		 if(!strcmp(param->argv[2],"bias"))
		 {
			 ret = qsfp28_get_ddmi(DDMI_BIAS, channel, DDMI_CALI_AFTER);
		 }
		 else if(!strcmp(param->argv[2],"txpower"))
		 {
			 ret = qsfp28_get_ddmi(DDMI_TXMON, channel, DDMI_CALI_AFTER);
		 }
		 else if(!strcmp(param->argv[2],"rxpower"))
		 {
			 ret =  qsfp28_get_ddmi(DDMI_RSSI, channel, DDMI_CALI_AFTER);
		 }
		 else
		 {
			 ret = RET_FAILED;
		 }
	 }

	 return ret;
}

static RETURN_VALUE_TYPE prvDispVendorPnConfig(PARAM_INFO_T  *param)
{
	uint8_t  ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))
	{
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, MSA_PAGE_00H, MSA_VENDOR_PN, param->argv[2], MSA_VENDOR_PN_LEN);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, MSA_PAGE_00H, MSA_VENDOR_PN, param->argv[2], MSA_VENDOR_PN_LEN);
		JUDGE_RETURN(ret);
		uart_printf("\r\nVender_pn:%s",param->argv[2]);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static RETURN_VALUE_TYPE prvDispVendorRevConfig(PARAM_INFO_T  *param)
{
	uint8_t  ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))
	{
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, MSA_PAGE_00H, MSA_VENDOR_REV, param->argv[2], MSA_VENDOR_REV_LEN);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, MSA_PAGE_00H, MSA_VENDOR_REV, param->argv[2], MSA_VENDOR_REV_LEN);
		JUDGE_RETURN(ret);
		uart_printf("\r\nVender_rev:%s",param->argv[2]);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static RETURN_VALUE_TYPE prvDispVendorSnConfig(PARAM_INFO_T  *param)
{
	uint8_t  ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))
	{
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, MSA_PAGE_00H, MSA_VENDOR_SN, param->argv[2], MSA_VENDOR_SN_LEN);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, MSA_PAGE_00H, MSA_VENDOR_SN, param->argv[2], MSA_VENDOR_SN_LEN);
		JUDGE_RETURN(ret);
		uart_printf("\r\nVender_sn:%s",param->argv[2]);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static RETURN_VALUE_TYPE prvDispDateCodeConfig(PARAM_INFO_T  *param)
{
	uint8_t  ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))
	{
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, MSA_PAGE_00H, MSA_DATA_CODE, param->argv[2], MSA_DATA_CODE_LEN);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, MSA_PAGE_00H, MSA_DATA_CODE, param->argv[2], MSA_DATA_CODE_LEN);
		JUDGE_RETURN(ret);
		uart_printf("\r\nDate_code:%s",param->argv[2]);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static RETURN_VALUE_TYPE prvDispSuperCodeConfig(PARAM_INFO_T  *param)
{
	uint8_t  ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))
	{
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, SUPERCODE, param->argv[2], SUPERCODE_LEN);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, SUPERCODE, param->argv[2], SUPERCODE_LEN);
		JUDGE_RETURN(ret);
		uart_printf("\r\nSupercode:%s",param->argv[2]);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static RETURN_VALUE_TYPE prvDispPcbaSnConfig(PARAM_INFO_T  *param)
{
	uint8_t  ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))
	{
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, PCBA_SN, param->argv[2], PCBA_SN_LEN);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, PCBA_SN, param->argv[2], PCBA_SN_LEN);
		JUDGE_RETURN(ret);
		uart_printf("\r\nPcba_sn:%s",param->argv[2]);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static RETURN_VALUE_TYPE prvDispPcbaCodeConfig(PARAM_INFO_T  *param)
{
	uint8_t  ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))
	{
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, PCBA_CODE, param->argv[2], PCBA_CODE_LEN);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, PCBA_CODE, param->argv[2], PCBA_CODE_LEN);
		JUDGE_RETURN(ret);
		uart_printf("\r\nPcba_code:%s",param->argv[2]);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static RETURN_VALUE_TYPE prvDispBondingConfig()
{
	return qsfp28_msa_page4_dbg_cmd(DBG_BONDING_MODE);
}

static RETURN_VALUE_TYPE prvDispFactoryResetConfig()
{
	return qsfp28_msa_page4_dbg_cmd(DBG_FACTORY_RESET_CMD);
}

static uint8_t _cli_laser_tx_sn_cmd(PARAM_INFO_T  *param)
{
	uint8_t  ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))
	{
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, LASER_TX_SN, param->argv[2], LASER_TX_SN_LEN);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H,  LASER_TX_SN, param->argv[2], LASER_TX_SN_LEN);
		JUDGE_RETURN(ret);
		uart_printf("\r\nLaser_tx_sn:%s",param->argv[2]);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static uint8_t _cli_rx_losa_cmd(PARAM_INFO_T  *param)
{
	uint16_t  value16 = 0;
	uint8_t ret = RET_OK, channel = 0;

	const uint8_t losa_addr[] = {RX_LOSA_THLD_CH0_MSB, RX_LOSA_THLD_CH1_MSB,RX_LOSA_THLD_CH2_MSB,RX_LOSA_THLD_CH3_MSB};

	if(RET_FAILED == (channel = _qsfp28_get_channel(param->argv[1])))
	{
		return RET_FAILED;
	}

	if (!strcmp(param->argv[0],"set"))   //set [ch0|ch1|ch2|ch3] losa_thld value(uA)
	{
		if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
		{
			value16 = com_str_to_int16(param->argv[3]);
			ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, losa_addr[channel], (uint8_t *)&value16, 2);
		}
		else
		{
			ret = RET_FAILED;
		}
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
		{
			ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, losa_addr[channel], (uint8_t *)&value16, 2);
			JUDGE_RETURN(ret);
			uart_printf("\r\nRx_losa_thld%bu:%hu",channel, value16);
		}
		else
		{
			ret = RET_FAILED;
		}
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static uint8_t _cli_rx_losd_cmd(PARAM_INFO_T  *param)
{
	uint16_t  value16 = 0;
	uint8_t   ret = RET_OK, channel = 0;

	const uint8_t losd_addr[] = {RX_LOSD_THLD_CH0_MSB, RX_LOSD_THLD_CH1_MSB,RX_LOSD_THLD_CH2_MSB,RX_LOSD_THLD_CH3_MSB};

