paddy2008/c51_uboot/src/Efm8lb12_cmd.c
	if(RET_FAILED == (channel = _qsfp28_get_channel(param->argv[1])))
	{
		return RET_FAILED;
	}

	if (!strcmp(param->argv[0],"set"))   //set [ch0|ch1|ch2|ch3] losd_thld value(uA)
	{
		if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
		{
			value16 = com_str_to_int16(param->argv[3]);
			ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, losd_addr[channel], (uint8_t *)&value16, 2);
		}
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
		{
			ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, losd_addr[channel], (uint8_t *)&value16, 2);
			JUDGE_RETURN(ret);
			uart_printf("\r\nRx_losd_thld%bu:%hu",channel, value16);
		}
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static uint8_t _cli_rx_los_mode_cmd(PARAM_INFO_T  *param)
{
	uint8_t  value8 = 0, ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))   //set rx_los mode [0|1]
	{
		value8 = com_str_to_int16(param->argv[3]);
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, RX_LOS_MODE, (uint8_t *)&value8, 1);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, RX_LOS_MODE, (uint8_t *)&value8, 1);
		JUDGE_RETURN(ret);
		uart_printf("\r\nRx_los_mode:%bu",value8);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static uint8_t _cli_rssi_darka_cmd(PARAM_INFO_T  *param)
{
	uint16_t  value16 = 0;
	uint8_t ret = RET_OK, channel = 0, i = 0;

	const uint8_t rssi_darka_addr[] = {RSSI_DRAKA_THLD_CH0_MSB, RSSI_DRAKA_THLD_CH1_MSB,RSSI_DRAKA_THLD_CH2_MSB,RSSI_DRAKA_THLD_CH3_MSB};

	if(RET_FAILED == (channel = _qsfp28_get_channel(param->argv[1])))
	{
		return RET_FAILED;
	}

	if (!strcmp(param->argv[0],"set"))   //set [ch0|ch1|ch2|ch3|all] darka_thld value(uA)
	{
		if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
		{
			value16 = com_str_to_int16(param->argv[3]);
			ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, rssi_darka_addr[channel], (uint8_t *)&value16, 2);
		}
		else if(channel == CHANNEL_MAX)
		{
			for(i = 0; i < CHANNEL_MAX; i++)
			{
				value16 = com_str_to_int16(param->argv[3]);
				ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, rssi_darka_addr[i], (uint8_t *)&value16, 2);
				JUDGE_RETURN(ret);
			}
		}
		else
		{
			ret = RET_FAILED;
		}
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
		{
			ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, rssi_darka_addr[channel], (uint8_t *)&value16, 2);
			JUDGE_RETURN(ret);
			uart_printf("\r\nRssi_darka_thld%bu:%hu",channel, value16);
		}
		else if(channel == CHANNEL_MAX)
		{
			for(i = 0; i < CHANNEL_MAX; i++)
			{
				ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, rssi_darka_addr[i], (uint8_t *)&value16, 2);
				JUDGE_RETURN(ret);
				uart_printf("\r\nRssi_darka_thld%bu:%hu",i, value16);
			}
		}
		else
		{
			ret = RET_FAILED;
		}
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static uint8_t _cli_rssi_darkd_cmd(PARAM_INFO_T  *param)
{
	uint16_t  value16 = 0;
	uint8_t   ret = RET_OK, channel = 0, i = 0;

	const uint8_t rssi_darkd_addr[] = {RSSI_DRAKD_THLD_CH0_MSB, RSSI_DRAKD_THLD_CH1_MSB,RSSI_DRAKD_THLD_CH2_MSB,RSSI_DRAKD_THLD_CH3_MSB};

	if(RET_FAILED == (channel = _qsfp28_get_channel(param->argv[1])))
	{
		return RET_FAILED;
	}

	if (!strcmp(param->argv[0],"set"))   //set [ch0|ch1|ch2|ch3] darkd_thld value(uA)
	{
		if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
		{
			value16 = com_str_to_int16(param->argv[3]);
			ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, rssi_darkd_addr[channel], (uint8_t *)&value16, 2);
		}
		else if(channel == CHANNEL_MAX)
		{
			for(i = 0; i < CHANNEL_MAX; i++)
			{
				value16 = com_str_to_int16(param->argv[3]);
				ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, rssi_darkd_addr[i], (uint8_t *)&value16, 2);
				JUDGE_RETURN(ret);
			}
		}
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
		{
			ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, rssi_darkd_addr[channel], (uint8_t *)&value16, 2);
			JUDGE_RETURN(ret);
			uart_printf("\r\nRssi_darkd_thld%bu:%hu",channel, value16);
		}
		else if(channel == CHANNEL_MAX)
		{
			for(i = 0; i < CHANNEL_MAX; i++)
			{
				ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_08H, rssi_darkd_addr[i], (uint8_t *)&value16, 2);
				JUDGE_RETURN(ret);
				uart_printf("\r\nRssi_darkd_thld%bu:%hu",i, value16);
			}
		}
		else
		{
			ret = RET_FAILED;
		}
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static uint8_t _cli_tx_config_laser(uint8_t channel, uint8_t enable)
{
	uint8_t value = 0, ret = RET_OK, tx_dis = 0;

	ret = i2c_master_read(I2C_DEVICE_ADDR, MSA_TX_ENABLE, (uint8_t *)&tx_dis, 1);

	tx_dis = tx_dis & 0x0F;

	if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
	{
		tx_dis = ((enable) ? (MY_CLEAR_BIT(tx_dis, channel)) : (MY_SET_BIT(tx_dis, channel)));  //enable = 1, Disable laser , enable = 0, Enable laser
	}
	else if(channel == CHANNEL_MAX)
	{
		tx_dis =  ((enable) ? (U8_CLEAR_LSB_4BITS(tx_dis)) : (U8_SET_LSB_4BITS(tx_dis)));
	}

	ret = i2c_master_write(I2C_DEVICE_ADDR, MSA_TX_ENABLE, (uint8_t *)&tx_dis, 1);

	return ret;
}

static uint8_t _cli_tx_get_laser_status(uint8_t channel)
{
	uint8_t tmp = 0, value = 0, ret = RET_OK;

	if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
	{
		ret = i2c_master_read(I2C_DEVICE_ADDR, MSA_TX_ENABLE, (uint8_t *)&value, 1);
		JUDGE_RETURN(ret);
		tmp = MY_GET_BIT(value, channel);
		uart_printf("\r\nPrbs%bu:%bu",channel, tmp);
	}
	else if(channel == CHANNEL_MAX)
	{
		for(channel = 0; channel  < CHANNEL_MAX; channel ++)
		{
			ret = i2c_master_read(I2C_DEVICE_ADDR, MSA_TX_ENABLE, (uint8_t *)&value, 1);
			JUDGE_RETURN(ret);
			tmp = MY_GET_BIT(value, channel);
			uart_printf("\r\nPrbs%bu:%bu",channel, tmp);
		}
	}
	return ret;
}

