paddy2008/c51_uboot/src/Efm8lb12_cmd.c
static uint8_t _cli_tx_laser_cmd(PARAM_INFO_T  *param)
{
	uint8_t  channel = 0, ret = RET_OK;

	channel = _qsfp28_get_channel(param->argv[1]);

	if (!strcmp(param->argv[0],"set"))
	{
		if (!strcmp(param->argv[3],"enable"))  //[set|get] [ch0|ch1|ch2|ch3|all] tx [enable|disable]
		{
			ret = _cli_tx_config_laser(channel, ENABLE_LAESER);
		}
		else if(!strcmp(param->argv[3],"disable"))
		{
			ret = _cli_tx_config_laser(channel, DISABLE_LAESER);
		}
	}
	else if(!strcmp(param->argv[0],"get"))
	{
		ret = _cli_tx_get_laser_status(channel);
	}
	return ret;
}

static uint8_t _cli_laser_rx_sn_cmd(PARAM_INFO_T  *param)
{
	uint8_t  ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))
	{
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, LASER_RX_SN, param->argv[2], LASER_RX_SN_LEN);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, LASER_RX_SN, param->argv[2], LASER_RX_SN_LEN);
		JUDGE_RETURN(ret);
		uart_printf("\r\nLaser_rx_sn:%s",param->argv[2]);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static uint8_t _cli_pic_code_cmd(PARAM_INFO_T  *param)
{
	uint8_t  ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))
	{
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, PICCODE, param->argv[2], PICCODE_LEN);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, PICCODE, param->argv[2], PICCODE_LEN);
		JUDGE_RETURN(ret);
		uart_printf("\r\nPic_code:%s",param->argv[2]);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static uint8_t _cli_module_type_cmd(PARAM_INFO_T  *param)
{
	uint8_t  ret = RET_OK;
	uint16_t value16 = 0;

	if (!strcmp(param->argv[0],"set"))
	{
		value16 = com_str_to_int16(param->argv[2]);
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, MSA_OFF_MODULE_TYPE, (uint8_t *)&value16, 2);
	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, MSA_OFF_MODULE_TYPE, (uint8_t *)&value16, 2);
		JUDGE_RETURN(ret);
		uart_printf("\r\nModule_type:0x%hx",value16);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static uint8_t _cli_hw_ver_cmd(PARAM_INFO_T  *param)
{
	uint8_t  value = 0, ret = RET_OK;

	if (!strcmp(param->argv[0],"set"))
	{
		value = (uint8_t)com_str_to_int16(param->argv[2]);
		ret = smb_write_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, MSA_OFF_HW_VER, (uint8_t *)&value, 1);

	}
	else if (!strcmp(param->argv[0],"get"))
	{
		ret = smb_read_page_byte(I2C_DEVICE_ADDR, SFP_PAGE_05H, MSA_OFF_HW_VER, (uint8_t *)&value, 1);
		JUDGE_RETURN(ret);
		uart_printf("\r\nHw_ver:%bx",value);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}


static uint8_t _cli_set_lut_tab(LUT_SHOW_TYPE show_type, MSA_LUT_TYPE lut_type, PARAM_INFO_T  *param)
{
	MSA_LASER_CH_CFG_T cfg;
	uint8_t  channel = 0, ret = RET_OK;

	 ret = ((RET_FAILED == (channel = _qsfp28_get_channel(param->argv[1]))) ? RET_FAILED : RET_OK);

	 if(channel == CHANNEL_MAX)
	 {
		 ret = RET_FAILED;
	 }
	 else if (!strcmp(param->argv[0],"set"))
	 {
		if(!strcmp(param->argv[3],"now"))
		{
			ret = qsfp28_set_lut_tab_para_from_reg_inner(channel, lut_type + 1);
			return ret;
		}
		cfg.temp  = com_str_to_int16(param->argv[3]);
		cfg.bias  = com_str_to_int16(param->argv[4]);
		cfg.mod	  = com_str_to_int16(param->argv[5]);
		cfg.cross = com_str_to_int16(param->argv[6]);
		cfg.temp  = cfg.temp * DDMI_CALI_TEMP_SCALE;   			//because the module receive result is actual temp * 256
		ret = qsfp28_set_lut_tab(channel, lut_type, cfg);
	 }
	 else if (!strcmp(param->argv[0],"get"))
	 {
		ret = qsfp28_get_lut_tab(channel, show_type, lut_type);
	 }
	 else
	 {
		 ret = RET_FAILED;
	 }

	 return ret;
}

static uint8_t _cli_get_all_lut_tab()
{
	uint8_t channel = 0, ret = RET_OK;

	uart_printf("\r\nchN	temp     bias    mod     crossing");
	uart_printf("\r\n---------------------------------------");
	for(channel = 0; channel < CHANNEL_MAX; channel++)
	{
		ret = qsfp28_get_lut_tab(channel,ALL_LUT_INFO, MSA_LUT_TYPE_LOW_TEMP);
		ret = qsfp28_get_lut_tab(channel,ALL_LUT_INFO, MSA_LUT_TYPE_MID_TEMP);
		ret = qsfp28_get_lut_tab(channel,ALL_LUT_INFO, MSA_LUT_TYPE_HI_TEMP);
	}

	return ret;
}

static RETURN_VALUE_TYPE prvDispLuttabConfig(PARAM_INFO_T  *param) //[get|set] [ch0|ch1|ch2|ch3] #[cur|fixed_temp] lut tab
{
	uint8_t channel = 0, ret = RET_OK;
	int16_t value16 = 0;

	if(RET_FAILED == (channel = _qsfp28_get_channel(param->argv[1])))
	{
		return RET_FAILED;
	}

	if (!strcmp(param->argv[0],"get"))
	{
		if (!strcmp(param->argv[2],"cur")) //get ch1 [cur|fixed_temp] lut tab
		{
			ret = qsfp28_get_cur_apc_value(channel);
		}
		else
		{
			value16 = com_str_to_int16(param->argv[2]);
			ret = qsfp28_get_fixed_temp_point_apc_value(value16, channel);
		}
	}

	/*
	else if (!strcmp(param->argv[0],"set"))
	{
		if (!strcmp(param->argv[2],"cur")) //set ch1 [cur|fixed_temp] lut tab
		{
			ret = qsfp28_set_cur_apc_value(channel);
		}
		else
		{
			value16 = com_str_to_int16(param->argv[2]);
			ret = qsfp28_set_fixed_temp_point_apc_value((uint8_t)value16, channel);
		}
	}
	*/

	return ret;
}

static uint8_t _cli_ddmi_cali(PARAM_INFO_T  *param)
{
	uint8_t channel = 0, ret = RET_OK;
	DDMI_CALI_PARA_T cali_para;

	if (!strcmp(param->argv[2],"temp_offset")) //set|get ddmi_cali temp_offset
	{
		if (!strcmp(param->argv[0],"set"))
		{
			if(CHECK_DDMI_CALI_TEMP_OFFSET(atof(param->argv[3])))
			{
				cali_para.temp = (int16_t)(atof(param->argv[3]) * (float)DDMI_CALI_TEMP_SCALE);
				ret = qsfp28_set_ddmi_cali_para(DDMI_TEMP, 0, &cali_para);  //uint:1/256 C
			}
			else
			{
				uart_printf( "\r\n Temp_offset is out of range");
				ret = RET_FAILED;
			}
		}
		else if (!strcmp(param->argv[0],"get"))
		{
			ret = qsfp28_get_ddmi_cali_para(DDMI_TEMP, 0, &cali_para);//uint:1/256 C
			JUDGE_RETURN(ret);
			uart_printf( "\r\n temp_offset:%f(C)", (float)cali_para.temp / (float)DDMI_CALI_TEMP_SCALE);
		}
		else
		{
			ret = RET_FAILED;
		}
	}
	else if (!strcmp(param->argv[2],"vcc_offset")) //set|get ddmi_cali_para vcc_offset
	{
		if (!strcmp(param->argv[0],"set"))
		{
			if(CHECK_DDMI_CALI_VCC_OFFSET(atof(param->argv[3])))
			{
				cali_para.vcc = (int16_t)(atof(param->argv[3]) * 1000.0 * 10);  //uint:0.1mv
				ret = qsfp28_set_ddmi_cali_para(DDMI_VCC, 0, &cali_para);
			}
			else
			{
				uart_printf( "\r\n Vcc_offset is out of range");
				ret = RET_FAILED;
			}
		}
		else if (!strcmp(param->argv[0],"get"))
		{
			ret = qsfp28_get_ddmi_cali_para(DDMI_VCC, 0, &cali_para);//uint:0.1mv
			JUDGE_RETURN(ret);
			uart_printf( "\r\n vcc_offset:%f(V)", (float)cali_para.vcc * 0.1 / 1000.0);
		}
		else
		{
			ret = RET_FAILED;
		}
	}
	else if (!strcmp(param->argv[3],"bias_offset"))  //set|get ddmi_cali_para [ch0|ch1|ch2|ch3|all] bias_offset bias_offset_x bias_offset_y
	{
		uint8_t i = 0;

