paddy2008/c51_uboot/src/Efm8lb12_cmd.c
		if(RET_FAILED == (channel = _qsfp28_get_channel(param->argv[2])))
		{
			return RET_FAILED;
		}

		if (!strcmp(param->argv[0],"set"))
		{
			if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
			{
				cali_para.current[channel].bias.bias_offset1 = (int16_t)(atof(param->argv[4]) * 10.0);  //uint:0.1mA
				cali_para.current[channel].bias.bias_offset2 = (int16_t)(atof(param->argv[5]) * 10.0);  //uint:0.1mA
				ret = qsfp28_set_ddmi_cali_para(DDMI_BIAS, channel, &cali_para);
			}
			else if(channel == CHANNEL_MAX)
			{
				for(i = CHANNEL0; i < CHANNEL_MAX; i++)
				{
					cali_para.current[i].bias.bias_offset1 = (int16_t)(atof(param->argv[4]) * 10.0);  //uint:0.1mA
					cali_para.current[i].bias.bias_offset2 = (int16_t)(atof(param->argv[5]) * 10.0);  //uint:0.1mA
					ret = qsfp28_set_ddmi_cali_para(DDMI_BIAS, i, &cali_para);
					JUDGE_RETURN(ret);
				}
			}
		}
		else if (!strcmp(param->argv[0],"get"))
		{
			if(channel >= CHANNEL0 && channel < CHANNEL_MAX)
			{
				ret = qsfp28_get_ddmi_cali_para(DDMI_BIAS, channel, &cali_para); //uint:0.1mA
				JUDGE_RETURN(ret);
				uart_printf( "\r\n ch%bu-bias_offset_x:%f(mA)\r\n ch%bu-bias_offset_y:%f(mA)",  \
						channel,(float)cali_para.current[channel].bias.bias_offset1 * 0.1,		  \
						channel,(float)cali_para.current[channel].bias.bias_offset2 * 0.1);
			}
			else if(channel == CHANNEL_MAX)
			{
				for(i = CHANNEL0; i < CHANNEL_MAX; i++)
				{
					ret = qsfp28_get_ddmi_cali_para(DDMI_BIAS, i, &cali_para); //uint:0.1mA
					JUDGE_RETURN(ret);
					uart_printf( "\r\n ch%bu-bias_offset_x:%f(mA)\r\n ch%bu-bias_offset_y:%f(mA)",  \
							i,(float)cali_para.current[i].bias.bias_offset1 * 0.1,		  \
							i,(float)cali_para.current[i].bias.bias_offset2 * 0.1);
				}
			}
		}
		else
		{
			ret = RET_FAILED;
		}
	}
	else if (!strcmp(param->argv[3],"txpwr"))  //set|get ddmi_cali_para [ch0|ch1|ch2|ch3] txpwr TXPOWER BIAS
	{
		if(RET_FAILED == (channel = _qsfp28_get_channel(param->argv[2])))
		{
			return RET_FAILED;
		}

		if (!strcmp(param->argv[0],"set"))
		{
			cali_para.current[channel].txpower.txpower1 = (uint16_t)(pow(10.0, atof(param->argv[4]) / 10.0) * 1000.0 * 10.0); //uint:0.1uW
			cali_para.current[channel].txpower.bias1    = (uint16_t)(atof(param->argv[5]) * 10.0); //uint:0.1mA

			cali_para.current[channel].txpower.txpower2 = (uint16_t)(pow(10.0, atof(param->argv[6]) / 10.0) * 1000.0 * 10.0); //uint:0.1uW
			cali_para.current[channel].txpower.bias2    = (uint16_t)(atof(param->argv[7]) * 10.0); //uint:0.1mA
			ret = qsfp28_set_ddmi_cali_para(DDMI_TXMON, channel, &cali_para);
		}
		else if (!strcmp(param->argv[0],"get"))
		{
			float txpower1 = 0.0, txpower2 = 0.0;

			ret = qsfp28_get_ddmi_cali_para(DDMI_TXMON, channel, &cali_para);
			JUDGE_RETURN(ret);
			txpower1 = (float)cali_para.current[channel].txpower.txpower1  * 0.1 /1000.0; //uint:mW
			txpower2 = (float)cali_para.current[channel].txpower.txpower2  * 0.1 /1000.0; //uint:mW

			uart_printf( "\r\nch%bu-txpower1:%f(dbm)\r\nch%bu-bias1   :%f(mA)\r\nch%bu-txpower2:%f(dbm)\r\nch%bu-bias2  :%f(mA)", \
					channel, (float)(10 * log10(txpower1)), 	   						\
					channel, (float)cali_para.current[channel].txpower.bias1 * 0.1 , 	\
					channel, (float)(10 * log10(txpower2)),        						\
					channel, (float)cali_para.current[channel].txpower.bias2 * 0.1);
		}
		else
		{
			ret = RET_FAILED;
		}
	}
	else if (!strcmp(param->argv[3],"rxpwr"))  //set|get ddmi_cali_para [ch0|ch1|ch2|ch3] rxpwr RXPOWER1 RSSI1 RXPOWER2 RSSI2
	{
		if(RET_FAILED == (channel = _qsfp28_get_channel(param->argv[2])))
		{
			return RET_FAILED;
		}

		if (!strcmp(param->argv[0],"set"))
		{
			if(CHECK_DDMI_CALI_POWER_OFFSET(atof(param->argv[4])) && //CHECK_DDMI_CALI_RSSI_OFFSET(com_str_to_int16(param->argv[5])) &&&& CHECK_DDMI_CALI_RSSI_OFFSET(com_str_to_int16(param->argv[7]))
			   CHECK_DDMI_CALI_POWER_OFFSET(atof(param->argv[6])) )
			{
				cali_para.current[channel].rxpower.rxpower1 = (uint16_t)(pow(10.0, atof(param->argv[4]) / 10.0) * 1000.0 * 10.0); //uint:0.1uW
				cali_para.current[channel].rxpower.rssi1    = (uint16_t)com_str_to_int16(param->argv[5]);
				cali_para.current[channel].rxpower.rxpower2 = (uint16_t)(pow(10.0, atof(param->argv[6])/ 10.0) * 1000.0 * 10.0); //uint:0.1uW
				cali_para.current[channel].rxpower.rssi2    = (uint16_t)com_str_to_int16(param->argv[7]);

				ret = qsfp28_set_ddmi_cali_para(DDMI_RSSI, channel, &cali_para);
			}
			else
			{
				uart_printf( "\r\nRxpower or rssi is out of range");
				ret = RET_FAILED;
			}
		}
		else if (!strcmp(param->argv[0],"get"))
		{
			float rxpower1 = 0.0, rxpower2 = 0.0;

			ret = qsfp28_get_ddmi_cali_para(DDMI_RSSI, channel, &cali_para);
			JUDGE_RETURN(ret);

			rxpower1 = (float)cali_para.current[channel].rxpower.rxpower1  * 0.1 /1000.0; //uint:mW
			rxpower2 = (float)cali_para.current[channel].rxpower.rxpower2  * 0.1 /1000.0; //uint:mW
			uart_printf( "\r\nch%bu-rxpower1:%f(dbm)\r\nch%bu-rssi1   :%hu(uA)\r\nch%bu-rxpower2:%f(dbm)\r\nch%bu-rssi2   :%hu(uA)", \
					channel, (float)(10 * log10(rxpower1)), 	   						\
					channel, cali_para.current[channel].rxpower.rssi1 , 	\
					channel, (float)(10 * log10(rxpower2)),        					\
					channel, cali_para.current[channel].rxpower.rssi2);
		}
		else
		{
			ret = RET_FAILED;
		}
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static uint8_t _cli_ddmi_cmd(PARAM_INFO_T  *param)
{
	uint8_t channel = 0, ret = RET_OK;

	 if(!strcmp(param->argv[2],"vcc"))
	 {
			 ret = qsfp28_get_ddmi(DDMI_VCC, 0, DDMI_CALI_BEFORE);  //get mcu vcc
	 }
	 else if(!strcmp(param->argv[2],"temp"))
	 {
			 ret = qsfp28_get_ddmi(DDMI_TEMP, 0, DDMI_CALI_BEFORE);  //get mcu temp
	 }
	 else
	 {
		 channel = (uint8_t)com_str_to_int16(param->argv[3]);

		 if(!strcmp(param->argv[2],"bias"))
		 {
			 ret = qsfp28_get_ddmi(DDMI_BIAS, channel, DDMI_CALI_BEFORE);
		 }
		 else if(!strcmp(param->argv[2],"txmon"))
		 {
			 ret = qsfp28_get_ddmi(DDMI_TXMON, channel, DDMI_CALI_BEFORE);
		 }
		 else if(!strcmp(param->argv[2],"rssi"))
		 {
			 ret =  qsfp28_get_ddmi(DDMI_RSSI, channel, DDMI_CALI_BEFORE);
		 }
		 else
		 {
			 ret = RET_FAILED;
		 }
	 }

	 return ret;
}


static uint8_t _cli_thrhld_cmd(PARAM_INFO_T  *param)
{
	uint8_t value = 0, ret = RET_OK;
	uint16_t value16 = 0;
	float    tmp_f = 1.0;
	MSA_PAGE3_ALARM_WARING_THRESHOLD_T type = UNKNOW_ALARM;

	tmp_f = atof(param->argv[3]);

	if(!strcmp(param->argv[2],"all"))
	{
		type = HTRHLD_ALL;
	}
	else if(!strcmp(param->argv[2],"temp_high_alarm"))  //temp
	{
		type = TEMP_HIGH_ALARM;
		value16 = (uint16_t)(tmp_f * (float)DDMI_CALI_TEMP_SCALE);
	}
	else if(!strcmp(param->argv[2],"temp_low_alarm"))
	{
		type = TEMP_LOW_ALARM;
		value16 = (uint16_t)(tmp_f * (float)DDMI_CALI_TEMP_SCALE);
	}
	else if(!strcmp(param->argv[2],"temp_high_warn"))
	{
		type = TEMP_HIGH_WARN;
		value16 = (uint16_t)(tmp_f * (float)DDMI_CALI_TEMP_SCALE);
	}
	else if(!strcmp(param->argv[2],"temp_low_warn"))
	{
		type = TEMP_LOW_WARN;
		value16 = (uint16_t)(tmp_f * (float)DDMI_CALI_TEMP_SCALE);
	}
	else if(!strcmp(param->argv[2],"vcc_high_alarm"))  // vcc
	{
		type = VCC_HIGH_ALARM;
		value16 = (uint16_t)(tmp_f * 1000.0 * 10.0);
	}
	else if(!strcmp(param->argv[2],"vcc_low_alarm"))
	{
		type = VCC_LOW_ALARM;
		value16 = (uint16_t)(tmp_f * 1000.0 * 10.0);
	}
	else if(!strcmp(param->argv[2],"vcc_high_warn"))
	{
		type = VCC_HIGH_WARN;
		value16 = (uint16_t)(tmp_f * 1000.0 * 10.0);
	}
	else if(!strcmp(param->argv[2],"vcc_low_warn"))
	{
		type = VCC_LOW_WARN;
		value16 = (uint16_t)(tmp_f * 1000.0 * 10.0);
	}
	else if(!strcmp(param->argv[2],"rxpwr_high_alarm"))  // rxpower
	{
		type = RXPWR_HIGH_ALARM;
		value16 = (uint16_t)(pow(10.0, tmp_f/10.0) * 10000.0);
	}
	else if(!strcmp(param->argv[2],"rxpwr_low_alarm"))
	{
		type = RXPWR_LOW_ALARM;
		value16 = (uint16_t)(pow(10.0, tmp_f/10.0) * 10000.0);
	}
	else if(!strcmp(param->argv[2],"rxpwr_high_warn"))
	{
		type = RXPWR_HIGH_WARN;
		value16 = (uint16_t)(pow(10.0, tmp_f/10.0) * 10000.0);
	}
	else if(!strcmp(param->argv[2],"rxpwr_low_warn"))
	{
		type =RXPWR_LOW_WARN;
		value16 = (uint16_t)(pow(10.0, tmp_f/10.0) * 10000.0);
	}
	else if(!strcmp(param->argv[2],"bias_high_alarm"))  // bias
	{
		type = TXBIAS_HIGH_ALARM;
		value16 = (uint16_t)(tmp_f * 1000.0 / 2.0);
	}
	else if(!strcmp(param->argv[2],"bias_low_alarm"))
	{
		type = TXBIAS_LOW_ALARM;
		value16 = (uint16_t)(tmp_f * 1000.0 / 2.0);
	}
	else if(!strcmp(param->argv[2],"bias_high_warn"))
	{
		type = TXBIAS_HIGH_WARN;
		value16 = (uint16_t)(tmp_f * 1000.0 / 2.0);
	}
	else if(!strcmp(param->argv[2],"bias_low_warn"))
	{
		type = TXBIAS_LOW_WARN;
		value16 = (uint16_t)(tmp_f * 1000.0 / 2.0);
	}
	else if(!strcmp(param->argv[2],"txpwr_high_alarm"))  // txpower
	{
		type = TXPWR_HIGH_ALARM;
		value16 = (uint16_t)(pow(10.0, tmp_f/10.0) * 10000.0);
	}
	else if(!strcmp(param->argv[2],"txpwr_low_alarm"))
	{
		type = TXPWR_LOW_ALARM;
		value16 = (uint16_t)(pow(10.0, tmp_f/10.0) * 10000.0);
	}
	else if(!strcmp(param->argv[2],"txpwr_high_warn"))
	{
		type = TXPWR_HIGH_WARN;
		value16 = (uint16_t)(pow(10.0, tmp_f/10.0) * 10000.0);
	}
	else if(!strcmp(param->argv[2],"txpwr_low_warn"))
	{
		type = TXPWR_LOW_WARN;
		value16 = (uint16_t)(pow(10.0, tmp_f/10.0) * 10000.0);
	}
	else
	{
		ret = RET_FAILED;
	}

	if(!strcmp(param->argv[0],"set"))
	{
	   if(value >= TEMP_HIGH_ALARM && value < HTRHLD_ALL)
		{
			ret = qsfp28_set_thrhld_value(type,value16);
		}
	}
	else if(!strcmp(param->argv[0],"get"))
	{
		ret = qsfp28_get_thrhld_value(type);
	}

	return ret;
}

static uint8_t _cli_module_class_cmd(PARAM_INFO_T  *param)
{
	uint8_t ret = RET_OK;

