paddy2008/c51_uboot/src/Efm8lb12_cmd.c
	if(!strcmp((char*)param->argv[0],"get"))
	{
		ret = qsfp28_get_module_class();
	}
	else if(!strcmp((char*)param->argv[0],"set"))
	{
		uint8_t value = (uint8_t)com_str_to_int16(param->argv[2]);

		ret = qsfp28_set_module_class(value);
	}
	else
	{
		ret = RET_FAILED;
	}
	return ret;
}

static uint8_t  _cli_set_iic_cmd(PARAM_INFO_T  *param)
{
	uint8_t ret = RET_OK;

	if(!strcmp(param->argv[0],"get"))
	{
		uart_printf("\r\n i2c Clock Speed : %hu kHz", i2c_master_get_freq());
	}
	else if(!strcmp(param->argv[0],"set"))
	{
		uint16_t Clock = com_str_to_int16(param->argv[2]);

		if(Clock > 30)
		{
			i2c_master_set_freq(Clock);
		}
		else
		{
			uart_printf("%s","\r\n Minimum frequency 30kHz ");
		}
	}
	else
	{
		ret = RET_FAILED;
	}
	return ret;
}

static uint8_t  _cli_get_mod_boot_reason_cmd(PARAM_INFO_T  *param)
{
	uint8_t ret = RET_OK;
	uint8_t value = 0;

	if(!strcmp(param->argv[0],"get"))
	{
    	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
    	JUDGE_RETURN(ret);
		ret = i2c_master_read_byte(I2C_DEVICE_ADDR, SFP_MOD_BOOT_REASON, &value);
		if(value == 0x03)
		{
			uart_printf("%s","\r\n Module state is normal");
		}
		else
		{
			uart_printf("%s","\r\n Module Watch Dog reboot");
		}
	}
	else
	{
		ret = RET_FAILED;
	}
	return ret;
}

static void _rssi_poll_timer_handle(void)
{
	uart_put_string("\r\n111");
}

static void _intl_get_ddmi_data_timer_handle()
{
	uart_put_string("\r\n222");
}

static void _prbs_code_timer_handle(void)  //1000ms Ö´ÐÐÒ»´Î
{
	uart_put_string("\r\n333");
}

static RETURN_VALUE_TYPE prvDispConfigRssiConfig(PARAM_INFO_T  *param)
{
	uint8_t ret = RET_OK;

	if(!strcmp(param->argv[1],"show"))
	{
		int16_t num = (int16_t)com_str_to_int16(param->argv[2]);

		if(num > 0 && num <= 30000)
		{
			rssi_poll_timer.timeout = num;
		}
		else
		{
			rssi_poll_timer.timeout = 500;
		}

		timer_start(&rssi_poll_timer);
	}
	else if(!strcmp(param->argv[1],"stop"))
	{
		timer_stop(&rssi_poll_timer);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static RETURN_VALUE_TYPE prvDispAutoAbleConfig(PARAM_INFO_T  *param)//auto enable|disable
{
	if(!strcmp(param->argv[1],"enable"))
	{
		return qsfp28_msa_page4_dbg_cmd(DBG_AUTO_ENABLE_CMD);
	}
	else
	{
		return qsfp28_msa_page4_dbg_cmd(DBG_AUTO_DISABLE_CMD);
	}
}

static RETURN_VALUE_TYPE prvDispDdmiAbleConfig(PARAM_INFO_T  *param) //ddmi enable|disable
{
	if(!strcmp(param->argv[1],"enable"))
	{
		return qsfp28_msa_page4_dbg_cmd(DBG_DDMI_ENABLE_CMD);
	}
	else
	{
		return qsfp28_msa_page4_dbg_cmd(DBG_DDMI_DISABLE_CMD);
	}
}

static RETURN_VALUE_TYPE prvDispTxcdrRxcdrI2cEnableConfig(PARAM_INFO_T  *param) //[txcdr|rxcdr] i2c enable
{
	if(!strcmp(param->argv[0],"txcdr"))
	{
		return qsfp28_msa_page4_dbg_cmd(DBG_I2C_TXCDR_ENABLE);
	}
	else if(!strcmp(param->argv[0],"rxcdr"))
	{
		return qsfp28_msa_page4_dbg_cmd(DBG_I2C_RXCDR_ENABLE);
	}
	else
	{
		return RET_FAILED;
	}
}

static RETURN_VALUE_TYPE prvDispUpgdConfig() //upgd
{
	return qsfp28_msa_page4_dbg_cmd(DBG_JUMP_TO_BOOT_CMD);
}

static RETURN_VALUE_TYPE prvDispAgingConfig(PARAM_INFO_T  *param) //aging [start|stop|clean]
{
	if(!strcmp(param->argv[1],"start"))
	{
		return qsfp28_msa_page4_dbg_cmd(DBG_AGING_START_CMD);
	}
	else if(!strcmp(param->argv[1],"stop"))
	{
		return qsfp28_msa_page4_dbg_cmd(DBG_AGING_STOP_CMD);
	}
	else// if(!strcmp(param->argv[1],"clear") )
	{
		return qsfp28_msa_page4_dbg_cmd(DBG_AGING_EEP_INIT_CMD);
	}
}

static RETURN_VALUE_TYPE prvIntlOutputConfig(PARAM_INFO_T  *param) //intl output [enable|disable]
{
	uint8_t ret = RET_OK;

	if(!strcmp(param->argv[2],"enable"))
	{
		timer_start(&intl_trigger_timer);
		port_match_all_interrupt_enable(1);
	}
	else if(!strcmp(param->argv[2],"disable"))
	{
		timer_stop(&intl_trigger_timer);
		port_match_all_interrupt_enable(0);
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

static RETURN_VALUE_TYPE prvDispLutConfig(PARAM_INFO_T  *param) //[get|set] [ch0|ch1|ch2|ch3|all] [lt|rt|ht|lut] #temp #bias #mod #cross
{
	if (!strcmp(param->argv[2],"lt"))  //set|get [ch1|ch2|ch3|ch4|all] lt temp bias mod cross
	{
		return _cli_set_lut_tab(PART_LUT_INFO, MSA_LUT_TYPE_LOW_TEMP, param);
	}
	else if (!strcmp(param->argv[2],"rt"))  //set|get [ch1|ch2|ch3|ch4|all] rt temp bias mod cross
	{
		return _cli_set_lut_tab(PART_LUT_INFO, MSA_LUT_TYPE_MID_TEMP, param);
	}
	else if (!strcmp(param->argv[2],"ht"))  //set|get [ch1|ch2|ch3|ch4|all] ht temp bias mod cross
	{
		return _cli_set_lut_tab(PART_LUT_INFO, MSA_LUT_TYPE_HI_TEMP, param);
	}
	else if (!strcmp(param->argv[2],"lut"))  //get all lut
	{
		return  _cli_get_all_lut_tab();
	}
	else
	{
		return  RET_FAILED;
	}
}

uint8_t M37049_tx_cdr_prbs_cmd(PARAM_INFO_T  *param) //"set [ch0|ch1|ch2|ch3|all] tx_prbs [enable|disable]"
{
	uint8_t ret = RET_OK, channel = 0;
	uint8_t ch[] = {CHANNEL2,CHANNEL1,CHANNEL3,CHANNEL0,CHANNEL_MAX};

	ret = ((RET_FAILED == (channel = _qsfp28_get_channel(param->argv[1]))) ? RET_FAILED : RET_OK);

	channel = ch[channel];

	if (!strcmp(param->argv[3],"enable"))
	{
		//ret = M37049_txcdr_prbs_enable(channel);
	}
	else if(!strcmp(param->argv[3],"disable"))
	{
		//ret = M37049_txcdr_prbs_disable(channel);
	}
	return ret;
}

uint8_t M37046_rx_cdr_prbs_pn_normal_cmd(PARAM_INFO_T  *param) //"set [ch0|ch1|ch2|ch3|all] rx_prbs check [enable|disable] #value(ms)"
{
	uint8_t ret = RET_OK, channel = 0;
	uint8_t ch[] = {CHANNEL1,CHANNEL2,CHANNEL0,CHANNEL3,CHANNEL_MAX};

	ret = ((RET_FAILED == (channel = _qsfp28_get_channel(param->argv[1]))) ? RET_FAILED : RET_OK);

	channel = ch[channel];

	if (!strcmp(param->argv[4],"enable"))
	{
		int16_t num = (int16_t)com_str_to_int16(param->argv[5]);

		if(num > 0 && num <= 30000)
		{
			prbs_code_timer.timeout = num;
		}
		else
		{
			prbs_code_timer.timeout = 1000;
		}

		timer_start(&prbs_code_timer);
		//return M37046_rxcdr_prbs_enable(channel, PN_NORMAL);
	}
	else if(!strcmp(param->argv[4],"disable"))
	{
		timer_stop(&prbs_code_timer);
		//return M37046_rxcdr_prbs_disable(channel);
	}
	return RET_FAILED;
}

uint8_t M37046_rx_cdr_prbs_pn_inverse_cmd(PARAM_INFO_T  *param) //"set [ch0|ch1|ch2|ch3|all] rx_prbs check inverse [enable|disable] #value(ms)"
{
	uint8_t ret = RET_OK, channel = 0;
	uint8_t ch[] = {CHANNEL1,CHANNEL2,CHANNEL0,CHANNEL3,CHANNEL_MAX};

	ret = ((RET_FAILED == (channel = _qsfp28_get_channel(param->argv[1]))) ? RET_FAILED : RET_OK);

