paddy2008/c51_uboot/src/Efm8lb12_cmd.c
	channel = ch[channel];

	if (!strcmp(param->argv[5],"enable"))
	{
		int16_t num = (int16_t)com_str_to_int16(param->argv[6]);

		if(num > 0 && num <= 30000)
		{
			prbs_code_timer.timeout = num;
		}
		else
		{
			prbs_code_timer.timeout = 1000;
		}

		timer_start(&prbs_code_timer);
		//ret = M37046_rxcdr_prbs_enable(channel, PN_INVERSE);
	}
	else if(!strcmp(param->argv[5],"disable"))
	{
		timer_stop(&prbs_code_timer);
		//ret = M37046_rxcdr_prbs_disable(channel);
	}
	return ret;
}

static RETURN_VALUE_TYPE prvDispshowReg(PARAM_INFO_T  *param) //ddmi enable|disable
{
	param = NULL;
	reg_add_show("P0", P0, 0x00);
	reg_add_show("P1", P1, 0x00);
	reg_add_show("P2", P2, 0x00);
	reg_add_show("P3", P3, 0x00);

	reg_add_show("P0MDOUT", P0MDOUT, 0x20);
	reg_add_show("P1MDOUT", P1MDOUT, 0x20);
	reg_add_show("P2MDOUT", P2MDOUT, 0x20);
	reg_add_show("P3MDOUT", P3MDOUT, 0x20);

	reg_add_show("P0MDIN", P0MDIN,  0x20);
	reg_add_show("P1MDIN", P1MDIN,  0x20);
	reg_add_show("P2MDIN", P2MDIN,  0x20);
	reg_add_show("P3MDIN", P3MDIN,  0x20);

	return RET_OK;
}

static RETURN_VALUE_TYPE prvDispReadWriteReg(PARAM_INFO_T  *param) //ddmi enable|disable
{
	int16_t num = 0;

	if (!strcmp(param->argv[0],"read"))  //read reg P0
	{
		if (!strcmp(param->argv[1],"reg"))
		{
			printf("\r\n%s\t = 0x%bx", param->argv[2], reg_read(param->argv[2]));
		}
	}
	else if (!strcmp(param->argv[0],"write"))  //write reg  P0 0x33
	{
		if (!strcmp(param->argv[1],"reg"))
		{
			num = (int16_t)com_str_to_int16(param->argv[3]);
			reg_write(param->argv[2], (MCU_BIT_WIDTH_T)num);
		}
	}


	return RET_OK;
}
void cmd_init()
{
	prbs_code_timer.function = _rssi_poll_timer_handle;
	prbs_code_timer.timeout  = 1000;

	timer_add(&prbs_code_timer);

	rssi_poll_timer.function = _prbs_code_timer_handle;
	rssi_poll_timer.timeout  = 2000;
	timer_add(&rssi_poll_timer);

	intl_trigger_timer.function = _intl_get_ddmi_data_timer_handle;
	intl_trigger_timer.timeout  = 3000;
	timer_add(&intl_trigger_timer);

	terminal_register_cmd("build info"	\
				  ,prvDispVersionConfig);
	terminal_register_cmd("reset"    \
				  ,prvDispResetConfig);
	terminal_register_cmd("reboot"    \
				  ,prvDispRebootConfig);
	terminal_register_cmd("factory_reset" \
				  ,prvDispFactoryResetConfig);
	terminal_register_cmd("get swver" \
				  ,prvDispSwverConfig);
	terminal_register_cmd("[opr|opw] &baseAddr &OffAddr #ParmNum(0~0xff)" \
					  ,prvDispOprwConfig);
	terminal_register_cmd("[mdior|mdiow] &baseAddr &OffAddr #ParmNum(0~0xff)" \
						  ,prvDispMdiorwConfig);
	terminal_register_cmd("get intl" \
				  ,prvDispInitConfig);
	terminal_register_cmd("get mod_status" \
				  ,prvDispModStatusConfig);
	terminal_register_cmd("enter bonding" \
				  ,prvDispBondingConfig);
	terminal_register_cmd("eep   [init|show|erase] " \
				  ,prvDispEepConfig);
	terminal_register_cmd("auto [enable|disable]" \
				  ,prvDispAutoAbleConfig);
	terminal_register_cmd("ddmi [enable|disable]" \
				  ,prvDispDdmiAbleConfig);
	terminal_register_cmd("aging [start|stop|clean]" \
				  ,prvDispAgingConfig);
	terminal_register_cmd("intl output [enable|disable]" \
				  ,prvIntlOutputConfig);
	terminal_register_cmd("test modsel #[0|1]" \
				  ,prvDispTestModselConfig);
	terminal_register_cmd("test modsel aborted" \
				  ,prvDispTestModselConfig);
	terminal_register_cmd("[get|set] lpmode #[0|1]" \
				  ,prvDispLpmodeConfig);
	terminal_register_cmd("[get|set] reset  #[0|1]" \
				  ,prvDispgsetResetConfig);
	terminal_register_cmd("[get|set] reset_l #[0|1]" \
				  ,prvDispgsetResetLevelConfig);
	terminal_register_cmd("[get|set] modsel #[0|1]" \
				  ,prvDispModselConfig);
	terminal_register_cmd("enter msa download" \
				  ,prvDispMsaDownloadConfig);
	terminal_register_cmd("rssi [show|stop] #value(ms)" \
				  ,prvDispConfigRssiConfig);
	terminal_register_cmd("mod_console [enable|disable]" \
				  ,prvDispConfigModConfig);
	terminal_register_cmd("[txcdr|rxcdr] i2c enable" \
				  ,prvDispTxcdrRxcdrI2cEnableConfig);
	terminal_register_cmd("[read|enable|disable|clear] log"    \
				  ,prvDispLogConfig);
	terminal_register_cmd("eep regset &devaddr &offsetaddr &value" \
				  ,prvDispEepConfig);
	terminal_register_cmd("[oprt|opwt] &baseAddr &OffAddr #ParmNum(0~0xff)" \
				  ,prvDispOprwConfig);
	terminal_register_cmd("[get|set] laser_tx_sn #" \
				  ,_cli_laser_tx_sn_cmd);
	terminal_register_cmd("[get|set] laser_rx_sn #" \
				  ,_cli_laser_rx_sn_cmd);
	terminal_register_cmd("[get|set] pic_code #" \
				  ,_cli_pic_code_cmd);
	terminal_register_cmd("[get|set] module_type #[0x101|0x206|0x211|0x301]" \
				  ,_cli_module_type_cmd);
	terminal_register_cmd("[get|set] hw_ver #value(AM)" \
				  ,_cli_hw_ver_cmd);
	terminal_register_cmd("[get|set] vendor_pn  #char[16]" \
				  ,prvDispVendorPnConfig);
	terminal_register_cmd("[get|set] vendor_rev #char[2]"  \
				  ,prvDispVendorRevConfig);
	terminal_register_cmd("[get|set] vendor_sn  #char[16]" \
				  ,prvDispVendorSnConfig);
	terminal_register_cmd("[get|set] date_code  #char[8]"  \
				  ,prvDispDateCodeConfig);
	terminal_register_cmd("[get|set] supercode  #char[9]"  \
				  ,prvDispSuperCodeConfig);
	terminal_register_cmd("[get|set] pcba_sn    #char[16]" \
				  ,prvDispPcbaSnConfig);
	terminal_register_cmd("[get|set] pcba_code  #char[16]" \
				  ,prvDispPcbaCodeConfig);
	terminal_register_cmd("get module [vcc|temp|bias|txpower|rxpower] #channel" \
				  ,prvDispModuleConfig);
	terminal_register_cmd("[get|set] [ch0|ch1|ch2|ch3|all] [lt|rt|ht|lut] #temp #bias #mod #cross" \
				  ,prvDispLutConfig);
	terminal_register_cmd("[get|set] [ch0|ch1|ch2|ch3] #[cur|fixed_temp] lut tab" \
				  ,prvDispLuttabConfig);
	terminal_register_cmd("[set|get] ddmi_cali [temp_offset|vcc_offset] #value" \
				  ,_cli_ddmi_cali);
	terminal_register_cmd("[set|get] ddmi_cali [ch0|ch1|ch2|ch3|all] bias_offset #BIAS_X #BIAS_Y" \
				  ,_cli_ddmi_cali);
	terminal_register_cmd("[set|get] ddmi_cali [ch0|ch1|ch2|ch3] txpwr #TXPWR1 #BIAS1 #TXPWR2 #BIAS2" \
				  ,_cli_ddmi_cali);
	terminal_register_cmd("[set|get] ddmi_cali [ch0|ch1|ch2|ch3] rxpwr #RXPWR1 #RSSI1 #RXPWR2 #RSSI2" \
				  ,_cli_ddmi_cali);
	terminal_register_cmd("get ddmi [vcc|temp]" \
				  ,_cli_ddmi_cmd);
	terminal_register_cmd("get ddmi [bias|txmon|rssi] [0|1|2|3]" \
				  ,_cli_ddmi_cmd);
	terminal_register_cmd("[set|get] thrhld [temp_high_alarm|temp_high_warn|temp_low_alarm|temp_low_warn] #value" \
				  ,_cli_thrhld_cmd);
	terminal_register_cmd("[set|get] thrhld [vcc_high_alarm|vcc_high_warn|vcc_low_alarm|vcc_low_warn]     #value" \
				  ,_cli_thrhld_cmd);
	terminal_register_cmd("[set|get] thrhld [bias_high_alarm|bias_high_warn|bias_low_alarm|bias_low_warn] #value" \
				  ,_cli_thrhld_cmd);
	terminal_register_cmd("[set|get] thrhld [rxpwr_high_alarm|rxpwr_high_warn|rxpwr_low_alarm|rxpwr_low_warn] #value" \
			      ,_cli_thrhld_cmd);
	terminal_register_cmd("[set|get] thrhld [txpwr_high_alarm|txpwr_high_warn|txpwr_low_alarm|txpwr_low_warn] #value" \
		    	  ,_cli_thrhld_cmd);
	terminal_register_cmd("[get|set] module_class #value" \
				  ,_cli_module_class_cmd);
	terminal_register_cmd("[set|get] iic_speed #value(kHz)" \
				  ,_cli_set_iic_cmd);
	terminal_register_cmd("get mod_boot_reason" \
				  ,_cli_get_mod_boot_reason_cmd);
	terminal_register_cmd("set [ch0|ch1|ch2|ch3|all] tx_prbs [enable|disable]" \
				  ,M37049_tx_cdr_prbs_cmd);
	terminal_register_cmd("set [ch0|ch1|ch2|ch3|all] rx_prbs check [enable|disable] #value(ms)" \
				  ,M37046_rx_cdr_prbs_pn_normal_cmd);
	terminal_register_cmd("set [ch0|ch1|ch2|ch3|all] rx_prbs invert check [enable|disable] #value(ms)" \
				  ,M37046_rx_cdr_prbs_pn_inverse_cmd);
	terminal_register_cmd("set [ch0|ch1|ch2|ch3|all] tx [enable|disable]" \
				  ,_cli_tx_laser_cmd);
	terminal_register_cmd("get [ch0|ch1|ch2|ch3|all] tx" \
				  ,_cli_tx_laser_cmd);
	terminal_register_cmd("[get|set] [ch0|ch1|ch2|ch3|all] darka_thld #value(uA)" \
				  ,_cli_rssi_darka_cmd);
	terminal_register_cmd("[get|set] [ch0|ch1|ch2|ch3|all] darkd_thld #value(uA)" \
				  ,_cli_rssi_darkd_cmd);
	terminal_register_cmd("[get|set] [ch0|ch1|ch2|ch3] losa_thld #value(uA)" \
				  ,_cli_rx_losa_cmd);
	terminal_register_cmd("[get|set] [ch0|ch1|ch2|ch3] losd_thld #value(uA)" \
				  ,_cli_rx_losd_cmd);
	terminal_register_cmd("show mcu reg" \
				  ,prvDispshowReg);
	terminal_register_cmd("[read|write] reg &reg_name #value" \
				  ,prvDispReadWriteReg);
}








